{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": null,
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "vocab": {
      "[PAD]": 0,
      "[UNK]": 1,
      "[CLS]": 2,
      "#": 3,
      "A": 4,
      "C": 5,
      "D": 6,
      "E": 7,
      "F": 8,
      "G": 9,
      "H": 10,
      "I": 11,
      "K": 12,
      "L": 13,
      "M": 14,
      "N": 15,
      "P": 16,
      "Q": 17,
      "R": 18,
      "S": 19,
      "T": 20,
      "V": 21,
      "W": 22,
      "Y": 23,
      "LL": 24,
      "AA": 25,
      "AL": 26,
      "VL": 27,
      "GL": 28,
      "EL": 29,
      "SL": 30,
      "RL": 31,
      "AV": 32,
      "AG": 33,
      "IL": 34,
      "TL": 35,
      "DL": 36,
      "KL": 37,
      "VV": 38,
      "GG": 39,
      "EE": 40,
      "SS": 41,
      "AI": 42,
      "AE": 43,
      "AR": 44,
      "AS": 45,
      "AD": 46,
      "PL": 47,
      "FL": 48,
      "GV": 49,
      "GI": 50,
      "AT": 51,
      "QL": 52,
      "KK": 53,
      "NL": 54,
      "TV": 55,
      "EI": 56,
      "AK": 57,
      "GS": 58,
      "RR": 59,
      "EK": 60,
      "YL": 61,
      "EV": 62,
      "DV": 63,
      "DI": 64,
      "GK": 65,
      "SV": 66,
      "AF": 67,
      "GR": 68,
      "GT": 69,
      "PV": 70,
      "SI": 71,
      "ER": 72,
      "TI": 73,
      "AQ": 74,
      "GD": 75,
      "AP": 76,
      "GF": 77,
      "NI": 78,
      "ED": 79,
      "RV": 80,
      "SK": 81,
      "RI": 82,
      "NV": 83,
      "FV": 84,
      "SD": 85,
      "ET": 86,
      "PD": 87,
      "ST": 88,
      "HL": 89,
      "KI": 90,
      "ML": 91,
      "AY": 92,
      "AN": 93,
      "GY": 94,
      "KV": 95,
      "FI": 96,
      "EQ": 97,
      "PI": 98,
      "SR": 99,
      "EN": 100,
      "GQ": 101,
      "TT": 102,
      "SF": 103,
      "DD": 104,
      "GN": 105,
      "GE": 106,
      "SP": 107,
      "QV": 108,
      "RD": 109,
      "AM": 110,
      "QI": 111,
      "KD": 112,
      "TD": 113,
      "FD": 114,
      "SN": 115,
      "YV": 116,
      "GP": 117,
      "TP": 118,
      "YI": 119,
      "RK": 120,
      "SQ": 121,
      "IV": 122,
      "AH": 123,
      "EF": 124,
      "WL": 125,
      "KN": 126,
      "SY": 127,
      "PP": 128,
      "GM": 129,
      "RT": 130,
      "SE": 131,
      "RQ": 132,
      "KT": 133,
      "RF": 134,
      "GH": 135,
      "RE": 136,
      "II": 137,
      "RN": 138,
      "YD": 139,
      "KE": 140,
      "FT": 141,
      "RP": 142,
      "CL": 143,
      "ID": 144,
      "PT": 145,
      "MV": 146,
      "ND": 147,
      "PE": 148,
      "KQ": 149,
      "HV": 150,
      "FN": 151,
      "QQ": 152,
      "RY": 153,
      "FF": 154,
      "SG": 155,
      "SH": 156,
      "NP": 157,
      "KP": 158,
      "SM": 159,
      "AW": 160,
      "YT": 161,
      "AC": 162,
      "VD": 163,
      "QD": 164,
      "EP": 165,
      "IT": 166,
      "NT": 167,
      "ALL": 168,
      "EY": 169,
      "QT": 170,
      "AAL": 171,
      "KR": 172,
      "KY": 173,
      "GW": 174,
      "DP": 175,
      "VI": 176,
      "NN": 177,
      "FP": 178,
      "RH": 179,
      "FY": 180,
      "MI": 181,
      "VT": 182,
      "GC": 183,
      "EH": 184,
      "RS": 185,
      "ES": 186,
      "MD": 187,
      "KF": 188,
      "LLL": 189,
      "EM": 190,
      "HI": 191,
      "FQ": 192,
      "KS": 193,
      "DT": 194,
      "FS": 195,
      "YP": 196,
      "MT": 197,
      "YN": 198,
      "QP": 199,
      "HP": 200,
      "QN": 201,
      "QK": 202,
      "FK": 203,
      "IN": 204,
      "IP": 205,
      "FE": 206,
      "RM": 207,
      "HD": 208,
      "TN": 209,
      "YY": 210,
      "VP": 211,
      "AVL": 212,
      "SC": 213,
      "AGL": 214,
      "QR": 215,
      "FR": 216,
      "QE": 217,
      "WV": 218,
      "HT": 219,
      "IK": 220,
      "DE": 221,
      "CV": 222,
      "IE": 223,
      "YF": 224,
      "NK": 225,
      "SW": 226,
      "GLL": 227,
      "YR": 228,
      "YQ": 229,
      "YK": 230,
      "TK": 231,
      "MP": 232,
      "AEL": 233,
      "TE": 234,
      "TF": 235,
      "VN": 236,
      "DK": 237,
      "VE": 238,
      "TR": 239,
      "PN": 240,
      "DN": 241,
      "YE": 242,
      "FG": 243,
      "IS": 244,
      "PK": 245,
      "VK": 246,
      "FH": 247,
      "MN": 248,
      "ARL": 249,
      "ASL": 250,
      "IR": 251,
      "VR": 252,
      "TQ": 253,
      "DR": 254,
      "TS": 255,
      "MK": 256,
      "ADL": 257,
      "TG": 258,
      "PQ": 259,
      "IQ": 260,
      "EG": 261,
      "PF": 262,
      "DF": 263,
      "SLL": 264,
      "ATL": 265,
      "PR": 266,
      "AIL": 267,
      "NQ": 268,
      "YS": 269,
      "IF": 270,
      "VQ": 271,
      "VS": 272,
      "CD": 273,
      "YH": 274,
      "PS": 275,
      "RG": 276,
      "MQ": 277,
      "WD": 278,
      "NE": 279,
      "VF": 280,
      "TY": 281,
      "ME": 282,
      "WI": 283,
      "GAL": 284,
      "NF": 285,
      "MR": 286,
      "NR": 287,
      "KH": 288,
      "DQ": 289,
      "GAA": 290,
      "CI": 291,
      "AKL": 292,
      "NY": 293,
      "DY": 294,
      "GVL": 295,
      "HF": 296,
      "NS": 297,
      "HQ": 298,
      "HR": 299,
      "WQ": 300,
      "AEE": 301,
      "AAV": 302,
      "DS": 303,
      "GAG": 304,
      "PY": 305,
      "AFL": 306,
      "GAV": 307,
      "GGL": 308,
      "ALV": 309,
      "ASS": 310,
      "MS": 311,
      "WT": 312,
      "QF": 313,
      "IY": 314,
      "WR": 315,
      "QS": 316,
      "ELL": 317,
      "TH": 318,
      "MF": 319,
      "CP": 320,
      "GSL": 321,
      "HH": 322,
      "CT": 323,
      "GVV": 324,
      "WN": 325,
      "WK": 326,
      "AQL": 327,
      "APL": 328,
      "EAL": 329,
      "IH": 330,
      "EEL": 331,
      "KM": 332,
      "GEL": 333,
      "QY": 334,
      "CR": 335,
      "GTL": 336,
      "HN": 337,
      "GIL": 338,
      "AKK": 339,
      "VY": 340,
      "CN": 341,
      "HK": 342,
      "GRL": 343,
      "HY": 344,
      "CK": 345,
      "LLD": 346,
      "AGV": 347,
      "GKL": 348,
      "AVV": 349,
      "LLV": 350,
      "VLV": 351,
      "WF": 352,
      "GDL": 353,
      "PH": 354,
      "CQ": 355,
      "ANL": 356,
      "TM": 357,
      "AAI": 358,
      "AYL": 359,
      "EW": 360,
      "RW": 361,
      "CF": 362,
      "SAL": 363,
      "GLV": 364,
      "RLL": 365,
      "SSL": 366,
      "GAI": 367,
      "EAA": 368,
      "MM": 369,
      "DH": 370,
      "EKL": 371,
      "CS": 372,
      "GAT": 373,
      "ERL": 374,
      "QH": 375,
      "FM": 376,
      "GAS": 377,
      "GAD": 378,
      "ALI": 379,
      "SAA": 380,
      "GSS": 381,
      "VLD": 382,
      "WP": 383,
      "MY": 384,
      "GTV": 385,
      "EC": 386,
      "NH": 387,
      "ELV": 388,
      "ALD": 389,
      "APV": 390,
      "GFL": 391,
      "RC": 392,
      "AGI": 393,
      "SLV": 394,
      "PM": 395,
      "HS": 396,
      "DM": 397,
      "GEI": 398,
      "QM": 399,
      "VVV": 400,
      "GEV": 401,
      "DLV": 402,
      "HE": 403,
      "SGL": 404,
      "RAL": 405,
      "GAR": 406,
      "KLL": 407,
      "RAA": 408,
      "FC": 409,
      "TC": 410,
      "FW": 411,
      "TW": 412,
      "AML": 413,
      "GGV": 414,
      "GEE": 415,
      "KEL": 416,
      "GKK": 417,
      "EVL": 418,
      "GAE": 419,
      "NM": 420,
      "TLL": 421,
      "GLI": 422,
      "RRL": 423,
      "GDV": 424,
      "TAA": 425,
      "EIL": 426,
      "DW": 427,
      "AVI": 428,
      "CY": 429,
      "GDI": 430,
      "SVL": 431,
      "ASV": 432,
      "IM": 433,
      "TLV": 434,
      "PLL": 435,
      "AIV": 436,
      "SEL": 437,
      "REL": 438,
      "CH": 439,
      "GNL": 440,
      "RLV": 441,
      "ATV": 442,
      "ALT": 443,
      "ESL": 444,
      "AEV": 445,
      "EDL": 446,
      "KKL": 447,
      "YM": 448,
      "LLI": 449,
      "SIL": 450,
      "KW": 451,
      "GRR": 452,
      "AAD": 453,
      "PW": 454,
      "GIV": 455,
      "GSV": 456,
      "KAL": 457,
      "ETL": 458,
      "CC": 459,
      "AHL": 460,
      "SLI": 461,
      "ANI": 462,
      "LLT": 463,
      "GLD": 464,
      "EAV": 465,
      "PLV": 466,
      "GQL": 467,
      "GYL": 468,
      "SGG": 469,
      "EEI": 470,
      "GAF": 471,
      "NW": 472,
      "TAL": 473,
      "GEK": 474,
      "RVL": 475,
      "GLP": 476,
      "ELI": 477,
      "GER": 478,
      "STL": 479,
      "ARV": 480,
      "QLL": 481,
      "MH": 482,
      "ANV": 483,
      "SKL": 484,
      "EEV": 485,
      "KC": 486,
      "SDL": 487,
      "SLD": 488,
      "ADV": 489,
      "VVD": 490,
      "SRL": 491,
      "ILV": 492,
      "EQL": 493,
      "VLI": 494,
      "GPL": 495,
      "KAA": 496,
      "GAK": 497,
      "LLP": 498,
      "SAV": 499,
      "ILD": 500,
      "EAG": 501,
      "WY": 502,
      "GRV": 503,
      "EAI": 504,
      "VLT": 505,
      "AEI": 506,
      "FLL": 507,
      "GAP": 508,
      "EGL": 509,
      "QAL": 510,
      "DLI": 511
    },
    "merges": [
      "L L",
      "A A",
      "A L",
      "V L",
      "G L",
      "E L",
      "S L",
      "R L",
      "A V",
      "A G",
      "I L",
      "T L",
      "D L",
      "K L",
      "V V",
      "G G",
      "E E",
      "S S",
      "A I",
      "A E",
      "A R",
      "A S",
      "A D",
      "P L",
      "F L",
      "G V",
      "G I",
      "A T",
      "Q L",
      "K K",
      "N L",
      "T V",
      "E I",
      "A K",
      "G S",
      "R R",
      "E K",
      "Y L",
      "E V",
      "D V",
      "D I",
      "G K",
      "S V",
      "A F",
      "G R",
      "G T",
      "P V",
      "S I",
      "E R",
      "T I",
      "A Q",
      "G D",
      "A P",
      "G F",
      "N I",
      "E D",
      "R V",
      "S K",
      "R I",
      "N V",
      "F V",
      "S D",
      "E T",
      "P D",
      "S T",
      "H L",
      "K I",
      "M L",
      "A Y",
      "A N",
      "G Y",
      "K V",
      "F I",
      "E Q",
      "P I",
      "S R",
      "E N",
      "G Q",
      "T T",
      "S F",
      "D D",
      "G N",
      "G E",
      "S P",
      "Q V",
      "R D",
      "A M",
      "Q I",
      "K D",
      "T D",
      "F D",
      "S N",
      "Y V",
      "G P",
      "T P",
      "Y I",
      "R K",
      "S Q",
      "I V",
      "A H",
      "E F",
      "W L",
      "K N",
      "S Y",
      "P P",
      "G M",
      "R T",
      "S E",
      "R Q",
      "K T",
      "R F",
      "G H",
      "R E",
      "I I",
      "R N",
      "Y D",
      "K E",
      "F T",
      "R P",
      "C L",
      "I D",
      "P T",
      "M V",
      "N D",
      "P E",
      "K Q",
      "H V",
      "F N",
      "Q Q",
      "R Y",
      "F F",
      "S G",
      "S H",
      "N P",
      "K P",
      "S M",
      "A W",
      "Y T",
      "A C",
      "V D",
      "Q D",
      "E P",
      "I T",
      "N T",
      "A LL",
      "E Y",
      "Q T",
      "AA L",
      "K R",
      "K Y",
      "G W",
      "D P",
      "V I",
      "N N",
      "F P",
      "R H",
      "F Y",
      "M I",
      "V T",
      "G C",
      "E H",
      "R S",
      "E S",
      "M D",
      "K F",
      "LL L",
      "E M",
      "H I",
      "F Q",
      "K S",
      "D T",
      "F S",
      "Y P",
      "M T",
      "Y N",
      "Q P",
      "H P",
      "Q N",
      "Q K",
      "F K",
      "I N",
      "I P",
      "F E",
      "R M",
      "H D",
      "T N",
      "Y Y",
      "V P",
      "A VL",
      "S C",
      "A GL",
      "Q R",
      "F R",
      "Q E",
      "W V",
      "H T",
      "I K",
      "D E",
      "C V",
      "I E",
      "Y F",
      "N K",
      "S W",
      "G LL",
      "Y R",
      "Y Q",
      "Y K",
      "T K",
      "M P",
      "A EL",
      "T E",
      "T F",
      "V N",
      "D K",
      "V E",
      "T R",
      "P N",
      "D N",
      "Y E",
      "F G",
      "I S",
      "P K",
      "V K",
      "F H",
      "M N",
      "A RL",
      "A SL",
      "I R",
      "V R",
      "T Q",
      "D R",
      "T S",
      "M K",
      "A DL",
      "T G",
      "P Q",
      "I Q",
      "E G",
      "P F",
      "D F",
      "S LL",
      "A TL",
      "P R",
      "A IL",
      "N Q",
      "Y S",
      "I F",
      "V Q",
      "V S",
      "C D",
      "Y H",
      "P S",
      "R G",
      "M Q",
      "W D",
      "N E",
      "V F",
      "T Y",
      "M E",
      "W I",
      "G AL",
      "N F",
      "M R",
      "N R",
      "K H",
      "D Q",
      "G AA",
      "C I",
      "A KL",
      "N Y",
      "D Y",
      "G VL",
      "H F",
      "N S",
      "H Q",
      "H R",
      "W Q",
      "A EE",
      "AA V",
      "D S",
      "G AG",
      "P Y",
      "A FL",
      "G AV",
      "G GL",
      "AL V",
      "A SS",
      "M S",
      "W T",
      "Q F",
      "I Y",
      "W R",
      "Q S",
      "E LL",
      "T H",
      "M F",
      "C P",
      "G SL",
      "H H",
      "C T",
      "G VV",
      "W N",
      "W K",
      "A QL",
      "A PL",
      "E AL",
      "I H",
      "E EL",
      "K M",
      "G EL",
      "Q Y",
      "C R",
      "G TL",
      "H N",
      "G IL",
      "A KK",
      "V Y",
      "C N",
      "H K",
      "G RL",
      "H Y",
      "C K",
      "LL D",
      "AG V",
      "G KL",
      "AV V",
      "LL V",
      "VL V",
      "W F",
      "G DL",
      "P H",
      "C Q",
      "A NL",
      "T M",
      "AA I",
      "A YL",
      "E W",
      "R W",
      "C F",
      "S AL",
      "GL V",
      "R LL",
      "S SL",
      "G AI",
      "E AA",
      "M M",
      "D H",
      "E KL",
      "C S",
      "G AT",
      "E RL",
      "Q H",
      "F M",
      "G AS",
      "G AD",
      "AL I",
      "S AA",
      "G SS",
      "VL D",
      "W P",
      "M Y",
      "G TV",
      "E C",
      "N H",
      "EL V",
      "AL D",
      "A PV",
      "G FL",
      "R C",
      "AG I",
      "SL V",
      "P M",
      "H S",
      "D M",
      "G EI",
      "Q M",
      "VV V",
      "G EV",
      "DL V",
      "H E",
      "S GL",
      "R AL",
      "G AR",
      "K LL",
      "R AA",
      "F C",
      "T C",
      "F W",
      "T W",
      "A ML",
      "GG V",
      "G EE",
      "K EL",
      "G KK",
      "E VL",
      "G AE",
      "N M",
      "T LL",
      "GL I",
      "R RL",
      "G DV",
      "T AA",
      "E IL",
      "D W",
      "AV I",
      "C Y",
      "G DI",
      "S VL",
      "AS V",
      "I M",
      "TL V",
      "P LL",
      "AI V",
      "S EL",
      "R EL",
      "C H",
      "G NL",
      "RL V",
      "AT V",
      "AL T",
      "E SL",
      "AE V",
      "E DL",
      "K KL",
      "Y M",
      "LL I",
      "S IL",
      "K W",
      "G RR",
      "AA D",
      "P W",
      "GI V",
      "GS V",
      "K AL",
      "E TL",
      "C C",
      "A HL",
      "SL I",
      "A NI",
      "LL T",
      "GL D",
      "E AV",
      "PL V",
      "G QL",
      "G YL",
      "S GG",
      "EE I",
      "G AF",
      "N W",
      "T AL",
      "G EK",
      "R VL",
      "GL P",
      "EL I",
      "G ER",
      "S TL",
      "AR V",
      "Q LL",
      "M H",
      "A NV",
      "S KL",
      "EE V",
      "K C",
      "S DL",
      "SL D",
      "AD V",
      "VV D",
      "S RL",
      "IL V",
      "E QL",
      "VL I",
      "G PL",
      "K AA",
      "G AK",
      "LL P",
      "S AV",
      "IL D",
      "E AG",
      "W Y",
      "GR V",
      "E AI",
      "VL T",
      "AE I",
      "F LL",
      "G AP",
      "E GL",
      "Q AL",
      "DL I"
    ]
  }
}